import React from 'react';
import Header from '../components/header/header.jsx';
import Footer from '../components/footer/footer.jsx';
import styles from './AboutPage.module.css';

function AboutPage() {
  return (
    <div className={styles.aboutPage}>
      <Header />

      <main className={styles.mainContent}>
        <div className={styles.textContainer}>
          <h1 className={styles.title}>Про нас</h1>
          <p className={styles.paragraph}>
            Ми віримо, що аромат — це більше, ніж просто запах. Це невидимий
            підпис особистості, ключ до найцінніших спогадів та найтонша форма
            мистецтва. Це мова, якою можна розповісти про себе, не сказавши ані
            слова.
          </p>
          <p className={styles.paragraph}>
            Цей простір створений з глибокої поваги та любові до парфумерії. Ми
            не продаємо флакони — ми досліджуємо історії, що приховані в них, і
            ділимося знаннями, які допомагають робити усвідомлений та осмислений
            вибір у безмежному світі ароматів.
          </p>

          <h2 className={styles.subtitle}>Наша Філософія</h2>
          <p className={styles.paragraph}>
            Наша головна мета — демістифікувати парфумерію, зробити її
            зрозумілою та доступною для кожного, хто хоче зануритися глибше. Ми
            прагнемо показати, що за кожною композицією стоїть ідея, історія та
            кропітка праця парфумера.
          </p>
          <p className={styles.paragraph}>
            Ми переконані, що вибір парфуму — це інтимний процес самопізнання.
            Тому ми не даємо готових відповідей, а надаємо інструменти: детальні
            огляди, аналіз нот та поради, які допоможуть вам знайти той самий
            аромат, що резонує саме з вами
          </p>

          <h2 className={styles.subtitle}>Слово від Засновника</h2>
          <p className={styles.paragraph}>Привіт, мене звати Рома.</p>
          <p className={styles.paragraph}>
            Моя подорож у світ парфумерії почалася не з колекціонування, а з
            простої цікавості: що робить аромат "незабутнім"? Чому одні парфуми
            стають легендами, а інші зникають безслідно? Чому один і той самий
            запах на різних людях розкривається абсолютно по-різному?
          </p>
          <p className={styles.paragraph}>
            Ці питання переросли у роки досліджень, читання та, звичайно,
            "прослуховування" сотень ароматів. Я зрозумів, що парфумерія — це
            цілий всесвіт, в якому легко загубитися без провідника. Цей сайт
            став моєю спробою створити такий путівник — місце, де можна не
            боятися ставити питання, вчитися та знаходити натхнення.
          </p>
          <p className={styles.paragraph}>
            Дякую, що ви тут і розділяєте цю подорож зі мною.
          </p>
        </div>
      </main>

      <Footer />
    </div>
  );
}

export default AboutPage;
